tmp/wsl_quad_bench_fast/arc_run1.txt
Running 10s test @ http://127.0.0.1:8080/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.08ms    2.69ms  49.67ms   71.69%
    Req/Sec     6.44k   535.85    10.25k    76.25%
  Latency Distribution
     50%    4.78ms
     75%    6.51ms
     90%    8.43ms
     99%   13.13ms
  514383 requests in 10.04s, 73.58MB read
Requests/sec:  51215.33
Transfer/sec:      7.33MB