tmp/wsl_quad_bench_fast/arc_run2.txt
Running 10s test @ http://127.0.0.1:8080/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.11ms    2.55ms  25.26ms   69.83%
    Req/Sec     6.37k   519.85    11.86k    73.38%
  Latency Distribution
     50%    4.86ms
     75%    6.54ms
     90%    8.39ms
     99%   12.65ms
  508711 requests in 10.04s, 72.77MB read
Requests/sec:  50644.76
Transfer/sec:      7.24MB