tmp/wsl_quad_bench_fast/arc_run3.txt
Running 10s test @ http://127.0.0.1:8080/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.07ms    2.53ms  27.05ms   69.45%
    Req/Sec     6.41k   503.57    10.07k    71.75%
  Latency Distribution
     50%    4.84ms
     75%    6.53ms
     90%    8.40ms
     99%   12.44ms
  511918 requests in 10.04s, 73.23MB read
Requests/sec:  50981.87
Transfer/sec:      7.29MB