tmp/wsl_quad_bench_fast/backend_run1.txt
Running 10s test @ http://127.0.0.1:3000/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.16ms    1.05ms  11.50ms   76.11%
    Req/Sec    31.65k     9.40k   92.33k    87.75%
  Latency Distribution
     50%    1.04ms
     75%    1.49ms
     90%    2.46ms
     99%    5.00ms
  2523730 requests in 10.05s, 361.01MB read
Requests/sec: 251203.07
Transfer/sec:     35.93MB