tmp/wsl_quad_bench_fast/backend_run2.txt
Running 10s test @ http://127.0.0.1:3000/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.19ms    1.08ms  10.06ms   77.89%
    Req/Sec    31.29k     5.52k  101.94k    78.25%
  Latency Distribution
     50%    1.05ms
     75%    1.44ms
     90%    2.53ms
     99%    5.25ms
  2495957 requests in 10.05s, 357.04MB read
Requests/sec: 248294.34
Transfer/sec:     35.52MB