tmp/wsl_quad_bench_fast/backend_run3.txt
Running 10s test @ http://127.0.0.1:3000/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.19ms    1.08ms  12.06ms   79.11%
    Req/Sec    31.28k     5.02k   66.90k    74.25%
  Latency Distribution
     50%    1.04ms
     75%    1.44ms
     90%    2.54ms
     99%    5.19ms
  2493961 requests in 10.03s, 356.75MB read
Requests/sec: 248612.00
Transfer/sec:     35.56MB