tmp/wsl_quad_bench_fast/nginx_run1.txt
Running 10s test @ http://127.0.0.1:8081/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.49ms    1.23ms  17.31ms   74.31%
    Req/Sec    13.05k     1.89k   25.78k    84.12%
  Latency Distribution
     50%    2.44ms
     75%    3.09ms
     90%    3.93ms
     99%    6.16ms
  1040865 requests in 10.04s, 148.89MB read
Requests/sec: 103676.98
Transfer/sec:     14.83MB