tmp/wsl_quad_bench_fast/nginx_run2.txt
Running 10s test @ http://127.0.0.1:8081/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.55ms    1.25ms  15.41ms   74.90%
    Req/Sec    12.78k     1.23k   20.58k    75.00%
  Latency Distribution
     50%    2.49ms
     75%    3.13ms
     90%    3.97ms
     99%    6.36ms
  1018287 requests in 10.03s, 145.66MB read
Requests/sec: 101532.16
Transfer/sec:     14.52MB