tmp/wsl_quad_bench_fast/nginx_run3.txt
Running 10s test @ http://127.0.0.1:8081/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.56ms    1.29ms  17.39ms   75.17%
    Req/Sec    12.75k     1.56k   20.20k    78.12%
  Latency Distribution
     50%    2.48ms
     75%    3.17ms
     90%    4.03ms
     99%    6.41ms
  1016095 requests in 10.02s, 145.35MB read
Requests/sec: 101389.99
Transfer/sec:     14.50MB