tmp/wsl_quad_bench_fast/pingora_min_run1.txt
Running 10s test @ http://127.0.0.1:8082/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.87ms    2.46ms  25.64ms   69.88%
    Req/Sec     6.70k   480.21     9.52k    71.25%
  Latency Distribution
     50%    4.61ms
     75%    6.24ms
     90%    8.05ms
     99%   12.14ms
  534936 requests in 10.04s, 76.52MB read
Requests/sec:  53298.67
Transfer/sec:      7.62MB