tmp/wsl_quad_bench_fast/pingora_min_run2.txt
Running 10s test @ http://127.0.0.1:8082/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.90ms    2.45ms  24.17ms   69.66%
    Req/Sec     6.65k   480.37    11.04k    74.50%
  Latency Distribution
     50%    4.67ms
     75%    6.30ms
     90%    8.06ms
     99%   12.09ms
  530405 requests in 10.04s, 75.88MB read
Requests/sec:  52820.42
Transfer/sec:      7.56MB