tmp/wsl_quad_bench_fast/pingora_min_run3.txt
Running 10s test @ http://127.0.0.1:8082/x
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.91ms    2.48ms  30.11ms   69.76%
    Req/Sec     6.63k   566.51    16.82k    82.62%
  Latency Distribution
     50%    4.66ms
     75%    6.32ms
     90%    8.14ms
     99%   12.20ms
  529263 requests in 10.05s, 75.71MB read
Requests/sec:  52688.72
Transfer/sec:      7.54MB